### Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [2]:
import pandas as pd 
pd_series = pd.Series([4,8,15,16,2,42])

In [3]:
pd_series

0     4
1     8
2    15
3    16
4     2
5    42
dtype: int64

### Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

In [4]:
list = [4,8,15,16,2,42,56,78,25,15]
x = pd.Series(list)
x

0     4
1     8
2    15
3    16
4     2
5    42
6    56
7    78
8    25
9    15
dtype: int64

### Q3. Create a Pandas DataFrame that contains the following data:

In [5]:
data_frame = pd.DataFrame({'Name': ('Alice','Bob','Claire'),
               'Age' : (25,30,27),
               'Gender' : ('Female','Male','Female')})

In [6]:
data_frame

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

### Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

A DataFrame is a two dimensional object that can have columns with potential different types. Different kind of inputs include dictionaries, lists, series, and even another DataFrame.

A Series is a one-dimensional object that can hold any data type such as integers, floats and strings.

Series is the part of the data frame but dataframe can not be part of the Series.

In [7]:
## Data Frame 
data_frame = pd.DataFrame({'Name': ('Alice','Bob','Claire'),
               'Age' : (25,30,27),
               'Gender' : ('Female','Male','Female')})
type(data_frame)

pandas.core.frame.DataFrame

In [8]:
### Series
Series = data_frame.Age

In [9]:
Series

0    25
1    30
2    27
Name: Age, dtype: int64

In [10]:
type(Series)

pandas.core.series.Series

### Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

In [11]:
# create sample dataframe with missing values
data5 = {'name': ['Utkarsh', 'Aditi', 'Nitin', 'Bhushan', 'Kritika'],
        'age': [25, 30, None, 40, 35],
        'city': ['Pune', 'Mumbai', 'Delhi', None, 'Banaras'],
        'category': ['A', 'B', 'A', 'B', 'A'],
        'sales': [400, 200, 250, 150, 450],
        'date': ['2022-01-01', '2022-01-02', '2022-01-03', '2022-01-04', '2022-01-05']}
df5 = pd.DataFrame(data5)
df5

      name   age     city category  sales        date
0  Utkarsh  25.0     Pune        A    400  2022-01-01
1    Aditi  30.0   Mumbai        B    200  2022-01-02
2    Nitin   NaN    Delhi        A    250  2022-01-03
3  Bhushan  40.0     None        B    150  2022-01-04
4  Kritika  35.0  Banaras        A    450  2022-01-05

### 1. dropna(): Removes any row with missing values.

In [12]:
dropped_df5 = df5.dropna(axis=0)
dropped_df5

      name   age     city category  sales        date
0  Utkarsh  25.0     Pune        A    400  2022-01-01
1    Aditi  30.0   Mumbai        B    200  2022-01-02
4  Kritika  35.0  Banaras        A    450  2022-01-05

### 2. fillna(): Fills missing values with a specified value or method.

In [13]:
filled_df5 = df5.fillna(0)
filled_df5

      name   age     city category  sales        date
0  Utkarsh  25.0     Pune        A    400  2022-01-01
1    Aditi  30.0   Mumbai        B    200  2022-01-02
2    Nitin   0.0    Delhi        A    250  2022-01-03
3  Bhushan  40.0        0        B    150  2022-01-04
4  Kritika  35.0  Banaras        A    450  2022-01-05

### 3. groupby(): Groups the DataFrame by one or more columns and allows for aggregation of the data.

In [14]:
sales_mean = df5.groupby('category').mean(numeric_only=True)
sales_mean

           age       sales
category
A         30.0  366.666667
B         35.0  175.000000

### 4. sort_values(): Sorts the DataFrame by one or more columns.

In [15]:
# Sorting by Sales in descending order
df5.sort_values(by='sales',ascending=False)

      name   age     city category  sales        date
4  Kritika  35.0  Banaras        A    450  2022-01-05
0  Utkarsh  25.0     Pune        A    400  2022-01-01
2    Nitin   NaN    Delhi        A    250  2022-01-03
1    Aditi  30.0   Mumbai        B    200  2022-01-02
3  Bhushan  40.0     None        B    150  2022-01-04

## Question 6: Which of the following is mutable in nature Series, DataFrame, Panel?
---

## Answer:

### In pandas, Series and DataFrame are mutable in nature.

### Panel is considered immutable.

### That means, Series and DataFrame objects can be modified after they are created, and any changes made to them will be reflected in the original objects. On the other hand, Panel objects are generally not modified once created, and any changes made to them usually result in the creation of a new object.

### Note that while Series and DataFrame objects are mutable, it is generally recommended to avoid modifying them in place, as this can lead to unexpected results and errors. Instead, it is often better to create a new object with the desired modifications.

## Question 7 : Create a DataFrame using multiple Series. Explain with an example.
---

## Answer:

### By using concat() method you can merge multiple series together into DataFrame. This takes several params, for our scenario we use list that takes series to combine and axis=1 to specify merge series as columns instead of rows. Note that using axis=0 appends series to rows instead of columns.

In [16]:

import pandas as pd
# Create pandas Series
courses = pd.Series(["Data Science Masters","Java with DSA","Full Stack Web Development"])
fees = pd.Series([7000,7500,8000])
discount  = pd.Series([3500,3000,2500])

# concat() supports to combine multiple series.
df7=pd.concat([courses,fees,discount],axis=1)
df7.columns = ['course','fees','discount']
df7

                       course  fees  discount
0        Data Science Masters  7000      3500
1               Java with DSA  7500      3000
2  Full Stack Web Development  8000      2500